data/cfdb/verification/taylor_couette/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 2D annular section for laminar circular Couette (Taylor-Couette) flow.
// Inner cylinder R_i = 0.05 m rotates at omega = 1 rad/s (rotatingWallVelocity),
// outer cylinder R_o = 0.10 m is stationary. Full 360 deg annulus built from
// 4 quarter blocks with arc edges; 1 cell in z (empty front/back) -> 2D.
// Cells: 4 quarters x 36 (theta) x 20 (radial) x 1 = 2880.

scale   1;

vertices
(
    // inner radius (R_i = 0.05), z = 0, angles 0/90/180/270 deg
    ( 0.05  0.0   0)      // 0
    ( 0.0   0.05  0)      // 1
    (-0.05  0.0   0)      // 2
    ( 0.0  -0.05  0)      // 3
    // outer radius (R_o = 0.10), z = 0
    ( 0.10  0.0   0)      // 4
    ( 0.0   0.10  0)      // 5
    (-0.10  0.0   0)      // 6
    ( 0.0  -0.10  0)      // 7
    // inner radius, z = 0.01
    ( 0.05  0.0   0.01)   // 8
    ( 0.0   0.05  0.01)   // 9
    (-0.05  0.0   0.01)   // 10
    ( 0.0  -0.05  0.01)   // 11
    // outer radius, z = 0.01
    ( 0.10  0.0   0.01)   // 12
    ( 0.0   0.10  0.01)   // 13
    (-0.10  0.0   0.01)   // 14
    ( 0.0  -0.10  0.01)   // 15
);

blocks
(
    // quarter 0: 0 -> 90 deg
    hex (0 4 5 1 8 12 13 9) (36 20 1) simpleGrading (1 1 1)
    // quarter 1: 90 -> 180 deg
    hex (1 5 6 2 9 13 14 10) (36 20 1) simpleGrading (1 1 1)
    // quarter 2: 180 -> 270 deg
    hex (2 6 7 3 10 14 15 11) (36 20 1) simpleGrading (1 1 1)
    // quarter 3: 270 -> 360 deg
    hex (3 7 4 0 11 15 12 8) (36 20 1) simpleGrading (1 1 1)
);

edges
(
    // inner arcs, z = 0 (through 45/135/225/315 deg points at R_i)
    arc 0 1  ( 0.03535533905932738  0.03535533905932738 0)
    arc 1 2  (-0.03535533905932738  0.03535533905932738 0)
    arc 2 3  (-0.03535533905932738 -0.03535533905932738 0)
    arc 3 0  ( 0.03535533905932738 -0.03535533905932738 0)
    // outer arcs, z = 0 (at R_o)
    arc 4 5  ( 0.07071067811865475  0.07071067811865475 0)
    arc 5 6  (-0.07071067811865475  0.07071067811865475 0)
    arc 6 7  (-0.07071067811865475 -0.07071067811865475 0)
    arc 7 4  ( 0.07071067811865475 -0.07071067811865475 0)
    // inner arcs, z = 0.01
    arc 8 9   ( 0.03535533905932738  0.03535533905932738 0.01)
    arc 9 10  (-0.03535533905932738  0.03535533905932738 0.01)
    arc 10 11 (-0.03535533905932738 -0.03535533905932738 0.01)
    arc 11 8  ( 0.03535533905932738 -0.03535533905932738 0.01)
    // outer arcs, z = 0.01
    arc 12 13 ( 0.07071067811865475  0.07071067811865475 0.01)
    arc 13 14 (-0.07071067811865475  0.07071067811865475 0.01)
    arc 14 15 (-0.07071067811865475 -0.07071067811865475 0.01)
    arc 15 12 ( 0.07071067811865475 -0.07071067811865475 0.01)
);

boundary
(
    innerCylinder
    {
        type wall;
        faces
        (
            (0 8 9 1)
            (1 9 10 2)
            (2 10 11 3)
            (3 11 8 0)
        );
    }
    outerCylinder
    {
        type wall;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
            (7 4 12 15)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
            (8 12 13 9)
            (9 13 14 10)
            (10 14 15 11)
            (11 15 12 8)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
